resources/programming/static-clojure-site-part4-refactoring-for-simplicity.html
<div id="edn">
{:title "Static clojure site part 4: Refactoring and simplifying" :date "2018-08-09" :tags ("clojure" "static-site")}
</div>
<div id="outline-container-orgf2d72f6" class="outline-2">
<h2 id="orgf2d72f6">Goals for today</h2>
<div class="outline-text-2" id="text-orgf2d72f6">
<ol class="org-ol">
<li>Re-factor code for increased simplicity. Add a namespace to process pages.<br /></li>
</ol>
<p>
Goals for the future&#x2026;<br />
</p>
<ol class="org-ol">
<li>List subfolder pages on index page.<br />
<ul class="org-ul">
<li>add edn metadata to fix names, links, etc.<br /></li>
</ul></li>
</ol>
</div>
</div>

<div id="outline-container-org4c2f30a" class="outline-2">
<h2 id="org4c2f30a">New namespace to process HTML</h2>
<div class="outline-text-2" id="text-org4c2f30a">
<p>
In the spirit of the <a href="https://www.youtube.com/watch?v=f84n5oFoZBc">Hammock driven development</a> I am going to re-think the code I am writing and make a plan for what exactly I want to do. First, of all, I want a way to process the text of pages independently without adding more little functions to this mess (mostly the <code>html-pages</code> function):<br />
</p>

<div class="org-src-container">
<pre class="src src-clojure"><span style="color: #707183;">(</span><span style="color: #0000FF;">defn</span> <span style="color: #006699;">html-pages</span> <span style="color: #7388D6;">[</span>base pages<span style="color: #7388D6;">]</span>
  <span style="color: #7388D6;">(</span>zipmap <span style="color: #909183;">(</span>map #<span style="color: #709870;">(</span>str base <span style="color: #BA36A5;">%</span><span style="color: #709870;">)</span> <span style="color: #709870;">(</span>map #<span style="color: #907373;">(</span><span style="color: #6434A3;">str</span><span style="color: #333333; background-color: #FFFFFF;">/</span><span style="color: #006FE0;">replace</span> <span style="color: #BA36A5;">%</span> #<span style="color: #008000;">"</span><span style="color: #b39ddb; font-weight: bold;">(?&lt;!</span><span style="color: #008000;">index</span><span style="color: #b39ddb; font-weight: bold;">)</span><span style="color: #000000; font-weight: bold;">\.</span><span style="color: #008000;">html$"</span> <span style="color: #008000;">""</span><span style="color: #907373;">)</span> <span style="color: #907373;">(</span><span style="color: #006FE0;">keys</span> pages<span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span>
          <span style="color: #909183;">(</span><span style="color: #006FE0;">map</span> #<span style="color: #709870;">(</span><span style="color: #0000FF;">fn</span> <span style="color: #907373;">[</span>req<span style="color: #907373;">]</span> <span style="color: #907373;">(</span>layout-base-header req <span style="color: #BA36A5;">%</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span>
               <span style="color: #709870;">(</span><span style="color: #006FE0;">map</span> format-images <span style="color: #907373;">(</span><span style="color: #006FE0;">vals</span> pages<span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388D6;">)</span><span style="color: #707183;">)</span>
<span style="color: #8D8D84;">;;</span><span style="color: #8D8D84; font-style: italic;">---- snip ---</span>

<span style="color: #707183;">(</span><span style="color: #0000FF;">defn</span> <span style="color: #006699;">get-pages</span> <span style="color: #7388D6;">[]</span>
  <span style="color: #7388D6;">(</span><span style="color: #6434A3;">stasis</span><span style="color: #333333; background-color: #FFFFFF;">/</span>merge-page-sources
   <span style="color: #909183;">{</span><span style="color: #006FE0;">:landing</span> <span style="color: #709870;">(</span>home-page <span style="color: #907373;">(</span><span style="color: #6434A3;">stasis</span><span style="color: #333333; background-color: #FFFFFF;">/</span>slurp-directory <span style="color: #008000;">"resources/home"</span> #<span style="color: #008000;">".*</span><span style="color: #000000; font-weight: bold;">\.</span><span style="color: #b39ddb; font-weight: bold;">(</span><span style="color: #008000;">html</span><span style="color: #b39ddb; font-weight: bold;">|</span><span style="color: #008000;">css</span><span style="color: #b39ddb; font-weight: bold;">|</span><span style="color: #008000;">js</span><span style="color: #b39ddb; font-weight: bold;">)</span><span style="color: #008000;">$"</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span>
    <span style="color: #006FE0;">:programming</span>  <span style="color: #709870;">(</span>html-pages <span style="color: #008000;">"/programming"</span> <span style="color: #907373;">(</span><span style="color: #6434A3;">stasis</span><span style="color: #333333; background-color: #FFFFFF;">/</span>slurp-directory <span style="color: #008000;">"resources/programming"</span> #<span style="color: #008000;">".*</span><span style="color: #000000; font-weight: bold;">\.</span><span style="color: #008000;">html$"</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span>
    <span style="color: #006FE0;">:science</span> <span style="color: #709870;">(</span>html-pages <span style="color: #008000;">"/science"</span> <span style="color: #907373;">(</span><span style="color: #6434A3;">stasis</span><span style="color: #333333; background-color: #FFFFFF;">/</span>slurp-directory <span style="color: #008000;">"resources/science"</span> #<span style="color: #008000;">".*</span><span style="color: #000000; font-weight: bold;">\.</span><span style="color: #008000;">html$"</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span>
    <span style="color: #006FE0;">:partials</span> <span style="color: #709870;">(</span>partial-pages <span style="color: #907373;">(</span><span style="color: #6434A3;">stasis</span><span style="color: #333333; background-color: #FFFFFF;">/</span>slurp-directory <span style="color: #008000;">"resources/partials"</span> #<span style="color: #008000;">".*</span><span style="color: #000000; font-weight: bold;">\.</span><span style="color: #008000;">html$"</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span>
    <span style="color: #006FE0;">:public</span> <span style="color: #709870;">(</span><span style="color: #6434A3;">stasis</span><span style="color: #333333; background-color: #FFFFFF;">/</span>slurp-directory <span style="color: #008000;">"resources/public"</span> #<span style="color: #008000;">".*</span><span style="color: #000000; font-weight: bold;">\.</span><span style="color: #b39ddb; font-weight: bold;">(</span><span style="color: #008000;">html</span><span style="color: #b39ddb; font-weight: bold;">|</span><span style="color: #008000;">css</span><span style="color: #b39ddb; font-weight: bold;">|</span><span style="color: #008000;">js</span><span style="color: #b39ddb; font-weight: bold;">)</span><span style="color: #008000;">$"</span><span style="color: #709870;">)</span><span style="color: #909183;">}</span><span style="color: #7388D6;">)</span><span style="color: #707183;">)</span>
<span style="color: #8D8D84;">;; </span><span style="color: #8D8D84; font-style: italic;">--- snip ---</span>

</pre>
</div>

<p>
While <code>html-pages</code> isn't that bad now, all the maps and anonymous functions are getting a bit dense for me, and I plan to do some more pre-processing so I think it would really be best to re-factor it now.<br />
I also have no idea what <code>partials</code> are for in my map in <code>get-pages</code> (just copied from the tutorial), so that should probably go too.<br />
</p>

<p>
So, first thing first, how do I break this up, and what should I spin off into the new namespace called <code>process-pages</code>?<br />
</p>

<p>
To deal with the second part, I moved all the functions that deal directly with html formatting to the <code>process-pages</code> namespace, this follows the rule that each namespace should do one thing. I'll have the main <code>web.clj</code> handle building and exporting, mostly with the <code>get-pages</code> and <code>export</code> functions, but it makes sense that the html formatting should happen elsewhere (along the same lines, I have export helper functions that I broke out into a namespace called <code>export-helpers</code>).<br />
</p>
</div>
</div>
<div id="outline-container-orgb1a1441" class="outline-2">
<h2 id="orgb1a1441">New namespace</h2>
<div class="outline-text-2" id="text-orgb1a1441">
<p>
The declaration for this namespace looks like so:<br />
</p>
<div class="org-src-container">
<pre class="src src-clojure"><span style="color: #8D8D84;">;; </span><span style="color: #8D8D84; font-style: italic;">website-clj/process_pages.clj</span>
<span style="color: #707183;">(</span><span style="color: #0000FF;">ns</span> <span style="color: #6434A3;">website-clj.process-pages</span>
  <span style="color: #7388D6;">(</span><span style="color: #006FE0;">:require</span> <span style="color: #909183;">[</span><span style="color: #6434A3;">clojure.string</span> <span style="color: #006FE0;">:as</span> str<span style="color: #909183;">]</span>
            <span style="color: #909183;">[</span><span style="color: #6434A3;">hiccup.page</span> <span style="color: #006FE0;">:refer</span> <span style="color: #709870;">[</span>html5<span style="color: #709870;">]</span><span style="color: #909183;">]</span>
            <span style="color: #909183;">[</span><span style="color: #6434A3;">hiccup.element</span> <span style="color: #006FE0;">:refer</span> <span style="color: #709870;">(</span>link-to image<span style="color: #709870;">)</span><span style="color: #909183;">]</span>
            <span style="color: #909183;">[</span><span style="color: #6434A3;">stasis.core</span> <span style="color: #006FE0;">:as</span> stasis<span style="color: #909183;">]</span><span style="color: #7388D6;">)</span><span style="color: #707183;">)</span> <span style="color: #8D8D84;">;; </span><span style="color: #8D8D84; font-style: italic;">only for testing?</span>

</pre>
</div>

<p>
And the functions included here will be <code>html-pages</code>, <code>layout-base-header</code>, <code>format-images</code>, the other prepare pages functions <code>partial-pages</code>, and <code>home-page</code>. And any others I write.<br />
Now I just change <code>web.clj</code> to accept the new ns, and add the alias in front of any of the new functions<br />
</p>

<div class="org-src-container">
<pre class="src src-clojure"><span style="color: #8D8D84;">;;</span><span style="color: #8D8D84; font-style: italic;">website-clj/web.clj</span>
<span style="color: #707183;">(</span><span style="color: #0000FF;">ns</span> <span style="color: #6434A3;">website-clj.web</span>
  <span style="color: #7388D6;">(</span><span style="color: #006FE0;">:require</span> <span style="color: #909183;">[</span><span style="color: #6434A3;">optimus.assets</span> <span style="color: #006FE0;">:as</span> assets<span style="color: #909183;">]</span>
            <span style="color: #909183;">[</span><span style="color: #6434A3;">optimus.export</span><span style="color: #909183;">]</span>
            <span style="color: #909183;">[</span><span style="color: #6434A3;">optimus.link</span> <span style="color: #006FE0;">:as</span> link<span style="color: #909183;">]</span> 
            <span style="color: #909183;">[</span><span style="color: #6434A3;">optimus.optimizations</span> <span style="color: #006FE0;">:as</span> optimizations<span style="color: #909183;">]</span>      
            <span style="color: #909183;">[</span><span style="color: #6434A3;">optimus.prime</span> <span style="color: #006FE0;">:as</span> optimus<span style="color: #909183;">]</span>                    
            <span style="color: #909183;">[</span><span style="color: #6434A3;">optimus.strategies</span> <span style="color: #006FE0;">:refer</span> <span style="color: #709870;">[</span>serve-live-assets<span style="color: #709870;">]</span><span style="color: #909183;">]</span>
            <span style="color: #909183;">[</span><span style="color: #6434A3;">clojure.java.io</span> <span style="color: #006FE0;">:as</span> io<span style="color: #909183;">]</span>
            <span style="color: #909183;">[</span><span style="color: #6434A3;">clojure.string</span> <span style="color: #006FE0;">:as</span> str<span style="color: #909183;">]</span>
            <span style="color: #909183;">[</span><span style="color: #6434A3;">stasis.core</span> <span style="color: #006FE0;">:as</span> stasis<span style="color: #909183;">]</span>
            <span style="color: #909183;">[</span><span style="color: #6434A3;">website-clj.export-helpers</span> <span style="color: #006FE0;">:as</span> helpers<span style="color: #909183;">]</span> <span style="color: #8D8D84;">;; </span><span style="color: #8D8D84; font-style: italic;">my export helper namespace</span>
            <span style="color: #909183;">[</span><span style="color: #6434A3;">website-clj.process-pages</span> <span style="color: #006FE0;">:as</span> process<span style="color: #909183;">]</span><span style="color: #7388D6;">)</span><span style="color: #707183;">)</span> <span style="color: #8D8D84;">;; </span><span style="color: #8D8D84; font-style: italic;">process-pages namespace</span>


</pre>
</div>
</div>
</div>

<div id="outline-container-orgf4e9852" class="outline-2">
<h2 id="orgf4e9852">break up <code>html-pages</code></h2>
<div class="outline-text-2" id="text-orgf4e9852">
<p>
Now for the first part, I'll look closely at <code>html-pages</code> and see what the different parts do<br />
</p>

<div class="org-src-container">
<pre class="src src-clojure"><span style="color: #8D8D84;">;; </span><span style="color: #8D8D84; font-style: italic;">main pages formatting function</span>
<span style="color: #707183;">(</span><span style="color: #0000FF;">defn</span> <span style="color: #006699;">html-pages</span> <span style="color: #7388D6;">[</span>base pages<span style="color: #7388D6;">]</span>
  <span style="color: #7388D6;">(</span><span style="color: #006FE0;">zipmap</span> <span style="color: #909183;">(</span><span style="color: #006FE0;">map</span> #<span style="color: #709870;">(</span><span style="color: #006FE0;">str</span> base <span style="color: #BA36A5;">%</span><span style="color: #709870;">)</span> <span style="color: #8D8D84;">;; </span><span style="color: #8D8D84; font-style: italic;">1</span>
               <span style="color: #709870;">(</span>map #<span style="color: #907373;">(</span><span style="color: #6434A3;">str</span><span style="color: #333333; background-color: #FFFFFF;">/</span><span style="color: #006FE0;">replace</span> <span style="color: #BA36A5;">%</span> #<span style="color: #008000;">"</span><span style="color: #b39ddb; font-weight: bold;">(?&lt;!</span><span style="color: #008000;">index</span><span style="color: #b39ddb; font-weight: bold;">)</span><span style="color: #000000; font-weight: bold;">\.</span><span style="color: #008000;">html$"</span> <span style="color: #008000;">""</span><span style="color: #907373;">)</span> <span style="color: #907373;">(</span><span style="color: #006FE0;">keys</span> pages<span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span> <span style="color: #8D8D84;">;; </span><span style="color: #8D8D84; font-style: italic;">2</span>
          <span style="color: #909183;">(</span><span style="color: #006FE0;">map</span> #<span style="color: #709870;">(</span><span style="color: #0000FF;">fn</span> <span style="color: #907373;">[</span>req<span style="color: #907373;">]</span> <span style="color: #907373;">(</span>layout-base-header req <span style="color: #BA36A5;">%</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span>
               <span style="color: #709870;">(</span><span style="color: #006FE0;">map</span> format-images <span style="color: #907373;">(</span><span style="color: #006FE0;">vals</span> pages<span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span> <span style="color: #8D8D84;">;; </span><span style="color: #8D8D84; font-style: italic;">3 </span>
          <span style="color: #7388D6;">)</span><span style="color: #707183;">)</span> <span style="color: #8D8D84;">;; </span><span style="color: #8D8D84; font-style: italic;">4</span>

</pre>
</div>

<ol class="org-ol">
<li>concatenates the "base url" onto the page name keys. This allows me to add things like "programming/" to the base of pages in the programming directory, and "science/" to the base of pages in the science directory. So the pages can be sub-sectioned into relevant topics.<br /></li>
<li>removes .html from keys, which are the page names IF they don't start in index, which is for landing pages and <i>needs</i> <code>.html</code>.<br /></li>
<li>applies the header to the pages, and fixes image links.<br /></li>
<li>returns a map of page names and values of raw html for pages. however this is a bunch of lazy functions<br /></li>
</ol>

<p>
Really not too complicated. But to be more explicit, I'll make named functions to fix this.<br />
To deal with <code>1</code> and <code>2</code>, I'll make a function to perform those roles.<br />
The new function and its use in <code>html-pages</code> looks like so:<br />
</p>

<div class="org-src-container">
<pre class="src src-clojure"><span style="color: #707183;">(</span><span style="color: #0000FF;">defn</span> <span style="color: #006699;">fmt-page-names</span> <span style="color: #7388D6;">[</span>base name<span style="color: #7388D6;">]</span>
  <span style="color: #7388D6;">(</span>str base <span style="color: #909183;">(</span><span style="color: #6434A3;">str</span><span style="color: #333333; background-color: #FFFFFF;">/</span><span style="color: #006FE0;">replace</span> name #<span style="color: #008000;">"</span><span style="color: #b39ddb; font-weight: bold;">(?&lt;!</span><span style="color: #008000;">index</span><span style="color: #b39ddb; font-weight: bold;">)</span><span style="color: #000000; font-weight: bold;">\.</span><span style="color: #008000;">html$"</span> <span style="color: #008000;">""</span><span style="color: #909183;">)</span><span style="color: #7388D6;">)</span><span style="color: #707183;">)</span> <span style="color: #8D8D84;">;; </span><span style="color: #8D8D84; font-style: italic;">takes care of 1 and 2!</span>

<span style="color: #8D8D84;">;; </span><span style="color: #8D8D84; font-style: italic;">main pages formatting function</span>
<span style="color: #707183;">(</span><span style="color: #0000FF;">defn</span> <span style="color: #006699;">html-pages</span> <span style="color: #7388D6;">[</span>base pages<span style="color: #7388D6;">]</span>
  <span style="color: #7388D6;">(</span><span style="color: #006FE0;">zipmap</span> <span style="color: #909183;">(</span><span style="color: #006FE0;">map</span> #<span style="color: #709870;">(</span>fmt-page-names base <span style="color: #BA36A5;">%</span><span style="color: #709870;">)</span> <span style="color: #709870;">(</span><span style="color: #006FE0;">keys</span> pages<span style="color: #709870;">)</span><span style="color: #909183;">)</span> <span style="color: #8D8D84;">;; </span><span style="color: #8D8D84; font-style: italic;">apply new fn</span>
          <span style="color: #909183;">(</span><span style="color: #006FE0;">map</span> #<span style="color: #709870;">(</span><span style="color: #0000FF;">fn</span> <span style="color: #907373;">[</span>req<span style="color: #907373;">]</span> <span style="color: #907373;">(</span>layout-base-header req <span style="color: #BA36A5;">%</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span> 
               <span style="color: #709870;">(</span><span style="color: #006FE0;">map</span> format-images <span style="color: #907373;">(</span><span style="color: #006FE0;">vals</span> pages<span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span> 
          <span style="color: #7388D6;">)</span><span style="color: #707183;">)</span>

</pre>
</div>

<p>
Great. I am happy with that. I'll cross 1 and 2 off the list. Now the second part is beginning to format the html. Rather than doing all the formatting in one function, I'll have change my <code>format-images</code> function to <code>format-html</code> and then when I have any other html formatting to do to <i>all</i> the pages I can add another function to <code>format-html</code>, which will just take raw html and mess with it. For now, it will only have the format-images function.<br />
</p>

<div class="org-src-container">
<pre class="src src-clojure"><span style="color: #8D8D84;">;; </span><span style="color: #8D8D84; font-style: italic;">format images</span>
<span style="color: #707183;">(</span><span style="color: #0000FF;">defn</span> <span style="color: #006699;">format-images</span> <span style="color: #7388D6;">[</span>html<span style="color: #7388D6;">]</span>
  <span style="color: #7388D6;">(</span><span style="color: #6434A3;">str</span><span style="color: #333333; background-color: #FFFFFF;">/</span><span style="color: #006FE0;">replace</span> html #<span style="color: #008000;">"src=</span><span style="color: #000000; font-weight: bold;">\"</span><span style="color: #008000;">img"</span> <span style="color: #008000;">"src=</span><span style="color: #000000; font-weight: bold;">\"</span><span style="color: #008000;">/img"</span><span style="color: #7388D6;">)</span><span style="color: #707183;">)</span>

<span style="color: #707183;">(</span><span style="color: #0000FF;">defn</span> <span style="color: #006699;">format-html</span> <span style="color: #7388D6;">[</span>html<span style="color: #7388D6;">]</span>
  <span style="color: #7388D6;">(</span><span style="color: #0000FF;">-&gt;</span> html
      <span style="color: #909183;">(</span>format-images<span style="color: #909183;">)</span><span style="color: #7388D6;">)</span>
  <span style="color: #8D8D84;">;; </span><span style="color: #8D8D84; font-style: italic;">other fns for html here</span>
  <span style="color: #707183;">)</span>

<span style="color: #8D8D84;">;; </span><span style="color: #8D8D84; font-style: italic;">main pages formatting function</span>
<span style="color: #707183;">(</span><span style="color: #0000FF;">defn</span> <span style="color: #006699;">html-pages</span> <span style="color: #7388D6;">[</span>base pages<span style="color: #7388D6;">]</span>
  <span style="color: #7388D6;">(</span><span style="color: #006FE0;">zipmap</span> <span style="color: #909183;">(</span><span style="color: #006FE0;">map</span> #<span style="color: #709870;">(</span>fmt-page-names base <span style="color: #BA36A5;">%</span><span style="color: #709870;">)</span> <span style="color: #709870;">(</span><span style="color: #006FE0;">keys</span> pages<span style="color: #709870;">)</span><span style="color: #909183;">)</span> 
          <span style="color: #909183;">(</span><span style="color: #006FE0;">map</span> #<span style="color: #709870;">(</span><span style="color: #0000FF;">fn</span> <span style="color: #907373;">[</span>req<span style="color: #907373;">]</span> <span style="color: #907373;">(</span>layout-base-header req <span style="color: #BA36A5;">%</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span> 
               <span style="color: #709870;">(</span><span style="color: #006FE0;">map</span> format-html <span style="color: #907373;">(</span><span style="color: #006FE0;">vals</span> pages<span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388D6;">)</span><span style="color: #707183;">)</span>

</pre>
</div>

<p>
I am a lot happier with this. I have reduced complexity in my code by breaking up the anonymous functions, and explicitly naming them. I also don't have to deal with adding more complexity to my main <code>html-pages</code> function for future html formatting. I can just add more functions to the <code>format-html</code> function with the threading macro and be done with it. This will make editing and adding stuff much easier and more straightforward. I am trying to be more concise using the threading macros <code>-&gt;</code> and <code>-&gt;&gt;</code>, which are explained really well <a href="https://cjohansen.no/clojure-to-die-for/">here</a>.<br />
</p>
</div>
</div>
